src/WinRMSharp.Tests/Data/Sessions/ProtocolRunCommandWithUnicode.yml

- Request:
    Method: POST
    Url: https://127.0.0.1:5986/wsman
    Headers: {}
    Body: >-
      <?xml version="1.0" encoding="utf-16"?>

      <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:cfg="http://schemas.microsoft.com/wbem/wsman/1/config" xmlns:env="http://www.w3.org/2003/05/soap-envelope">
        <env:Header>
          <a:To>http://windows-host:5985/wsman</a:To>
          <a:ReplyTo>
            <a:Address mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
          </a:ReplyTo>
          <w:MaxEnvelopeSize a:mustUnderstand="true">153600</w:MaxEnvelopeSize>
          <a:MessageID>uuid:00000000-0000-0000-0000-000000000000</a:MessageID>
          <w:Locale a:mustUnderstand="false" xml:lang="en-US" />
          <p:DataLocale a:mustUnderstand="false" xml:lang="en-US" />
          <w:OperationTimeout>PT5S</w:OperationTimeout>
          <w:ResourceURI a:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
          <a:Action mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/Create</a:Action>
          <w:OptionSet>
            <w:Option Name="WINRS_CODEPAGE">65001</w:Option>
          </w:OptionSet>
        </env:Header>
        <env:Body>
          <rsp:Shell>
            <rsp:InputStreams>stdin</rsp:InputStreams>
            <rsp:OutputStreams>stdout stderr</rsp:OutputStreams>
          </rsp:Shell>
        </env:Body>
      </env:Envelope>
  Response:
    StatusCode: 200
    Headers:
      Server: Microsoft-HTTPAPI/2.0
      Date: Fri, 16 Dec 2022 23:58:24 GMT
    Body: >-
      <s:Envelope xml:lang="en-US" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
        <s:Header>
          <a:Action>http://schemas.xmlsoap.org/ws/2004/09/transfer/CreateResponse</a:Action>
          <a:MessageID>uuid:A1CAB495-29B9-423E-8AC1-AA74D4AF7B22</a:MessageID>
          <a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To>
          <a:RelatesTo>uuid:00000000-0000-0000-0000-000000000000</a:RelatesTo>
        </s:Header>
        <s:Body>
          <x:ResourceCreated>
            <a:Address>http://windows-host:5985/wsman</a:Address>
            <a:ReferenceParameters>
              <w:ResourceURI>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
              <w:SelectorSet>
                <w:Selector Name="ShellId">C5D0E586-F22B-425C-AB7C-6355765E0CF8</w:Selector>
              </w:SelectorSet>
            </a:ReferenceParameters>
          </x:ResourceCreated>
          <rsp:Shell xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell">
            <rsp:ShellId>C5D0E586-F22B-425C-AB7C-6355765E0CF8</rsp:ShellId>
            <rsp:ResourceUri>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</rsp:ResourceUri>
            <rsp:Owner>winrm-vm-003\Default</rsp:Owner>
            <rsp:ClientIP>73.53.37.241</rsp:ClientIP>
            <rsp:IdleTimeOut>PT7200.000S</rsp:IdleTimeOut>
            <rsp:InputStreams>stdin</rsp:InputStreams>
            <rsp:OutputStreams>stdout stderr</rsp:OutputStreams>
            <rsp:ShellRunTime>P0DT0H0M0S</rsp:ShellRunTime>
            <rsp:ShellInactivity>P0DT0H0M0S</rsp:ShellInactivity>
          </rsp:Shell>
        </s:Body>
      </s:Envelope>
- Request:
    Method: POST
    Url: https://127.0.0.1:5986/wsman
    Headers: {}
    Body: >-
      <?xml version="1.0" encoding="utf-16"?>

      <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:cfg="http://schemas.microsoft.com/wbem/wsman/1/config" xmlns:env="http://www.w3.org/2003/05/soap-envelope">
        <env:Header>
          <a:To>http://windows-host:5985/wsman</a:To>
          <a:ReplyTo>
            <a:Address mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
          </a:ReplyTo>
          <w:MaxEnvelopeSize a:mustUnderstand="true">153600</w:MaxEnvelopeSize>
          <a:MessageID>uuid:00000000-0000-0000-0000-000000000001</a:MessageID>
          <w:Locale a:mustUnderstand="false" xml:lang="en-US" />
          <p:DataLocale a:mustUnderstand="false" xml:lang="en-US" />
          <w:OperationTimeout>PT5S</w:OperationTimeout>
          <w:ResourceURI a:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
          <a:Action mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/Command</a:Action>
          <w:OptionSet>
            <w:Option Name="WINRS_CONSOLEMODE_STDIN">TRUE</w:Option>
            <w:Option Name="WINRS_SKIP_CMD_SHELL">FALSE</w:Option>
          </w:OptionSet>
          <w:SelectorSet>
            <w:Selector Name="ShellId">C5D0E586-F22B-425C-AB7C-6355765E0CF8</w:Selector>
          </w:SelectorSet>
        </env:Header>
        <env:Body>
          <rsp:CommandLine>
            <rsp:Command>powershell.exe</rsp:Command>
            <rsp:Arguments>Write-Host こんにちは</rsp:Arguments>
          </rsp:CommandLine>
        </env:Body>
      </env:Envelope>
  Response:
    StatusCode: 200
    Headers:
      Server: Microsoft-HTTPAPI/2.0
      Date: Fri, 16 Dec 2022 23:58:25 GMT
    Body: >-
      <s:Envelope xml:lang="en-US" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
        <s:Header>
          <a:Action>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/CommandResponse</a:Action>
          <a:MessageID>uuid:505B63BC-CC1D-4EB0-AE1A-E24EEA437415</a:MessageID>
          <a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To>
          <a:RelatesTo>uuid:00000000-0000-0000-0000-000000000001</a:RelatesTo>
        </s:Header>
        <s:Body>
          <rsp:CommandResponse>
            <rsp:CommandId>4A19F8A1-C71C-42F7-AE08-0BC1CA4FB785</rsp:CommandId>
          </rsp:CommandResponse>
        </s:Body>
      </s:Envelope>
- Request:
    Method: POST
    Url: https://127.0.0.1:5986/wsman
    Headers: {}
    Body: >-
      <?xml version="1.0" encoding="utf-16"?>

      <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:cfg="http://schemas.microsoft.com/wbem/wsman/1/config" xmlns:env="http://www.w3.org/2003/05/soap-envelope">
        <env:Header>
          <a:To>http://windows-host:5985/wsman</a:To>
          <a:ReplyTo>
            <a:Address mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
          </a:ReplyTo>
          <w:MaxEnvelopeSize a:mustUnderstand="true">153600</w:MaxEnvelopeSize>
          <a:MessageID>uuid:00000000-0000-0000-0000-000000000002</a:MessageID>
          <w:Locale a:mustUnderstand="false" xml:lang="en-US" />
          <p:DataLocale a:mustUnderstand="false" xml:lang="en-US" />
          <w:OperationTimeout>PT5S</w:OperationTimeout>
          <w:ResourceURI a:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
          <a:Action mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/Receive</a:Action>
          <w:SelectorSet>
            <w:Selector Name="ShellId">C5D0E586-F22B-425C-AB7C-6355765E0CF8</w:Selector>
          </w:SelectorSet>
        </env:Header>
        <env:Body>
          <rsp:Receive>
            <rsp:DesiredStream CommandId="4A19F8A1-C71C-42F7-AE08-0BC1CA4FB785">stdout stderr</rsp:DesiredStream>
          </rsp:Receive>
        </env:Body>
      </env:Envelope>
  Response:
    StatusCode: 200
    Headers:
      Server: Microsoft-HTTPAPI/2.0
      Date: Fri, 16 Dec 2022 23:58:25 GMT
    Body: >-
      <s:Envelope xml:lang="en-US" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
        <s:Header>
          <a:Action>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/ReceiveResponse</a:Action>
          <a:MessageID>uuid:F9D673D0-1E6E-4FDA-9CD5-E6EB99F62F2E</a:MessageID>
          <a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To>
          <a:RelatesTo>uuid:00000000-0000-0000-0000-000000000002</a:RelatesTo>
        </s:Header>
        <s:Body>
          <rsp:ReceiveResponse>
            <rsp:Stream Name="stdout" CommandId="4A19F8A1-C71C-42F7-AE08-0BC1CA4FB785">44GT44KT44Gr44Gh44Gv</rsp:Stream>
            <rsp:Stream Name="stdout" CommandId="4A19F8A1-C71C-42F7-AE08-0BC1CA4FB785">Cg==</rsp:Stream>
            <rsp:Stream Name="stdout" CommandId="4A19F8A1-C71C-42F7-AE08-0BC1CA4FB785" End="true"></rsp:Stream>
            <rsp:Stream Name="stderr" CommandId="4A19F8A1-C71C-42F7-AE08-0BC1CA4FB785" End="true"></rsp:Stream>
            <rsp:CommandState CommandId="4A19F8A1-C71C-42F7-AE08-0BC1CA4FB785" State="http://schemas.microsoft.com/wbem/wsman/1/windows/shell/CommandState/Done">
              <rsp:ExitCode>0</rsp:ExitCode>
            </rsp:CommandState>
          </rsp:ReceiveResponse>
        </s:Body>
      </s:Envelope>
- Request:
    Method: POST
    Url: https://127.0.0.1:5986/wsman
    Headers: {}
    Body: >-
      <?xml version="1.0" encoding="utf-16"?>

      <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:cfg="http://schemas.microsoft.com/wbem/wsman/1/config" xmlns:env="http://www.w3.org/2003/05/soap-envelope">
        <env:Header>
          <a:To>http://windows-host:5985/wsman</a:To>
          <a:ReplyTo>
            <a:Address mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
          </a:ReplyTo>
          <w:MaxEnvelopeSize a:mustUnderstand="true">153600</w:MaxEnvelopeSize>
          <a:MessageID>uuid:00000000-0000-0000-0000-000000000003</a:MessageID>
          <w:Locale a:mustUnderstand="false" xml:lang="en-US" />
          <p:DataLocale a:mustUnderstand="false" xml:lang="en-US" />
          <w:OperationTimeout>PT5S</w:OperationTimeout>
          <w:ResourceURI a:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
          <a:Action mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/Signal</a:Action>
          <w:SelectorSet>
            <w:Selector Name="ShellId">C5D0E586-F22B-425C-AB7C-6355765E0CF8</w:Selector>
          </w:SelectorSet>
        </env:Header>
        <env:Body>
          <rsp:Signal CommandId="4A19F8A1-C71C-42F7-AE08-0BC1CA4FB785">
            <rsp:Code>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/signal/terminate</rsp:Code>
          </rsp:Signal>
        </env:Body>
      </env:Envelope>
  Response:
    StatusCode: 200
    Headers:
      Server: Microsoft-HTTPAPI/2.0
      Date: Fri, 16 Dec 2022 23:58:25 GMT
    Body: >-
      <s:Envelope xml:lang="en-US" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
        <s:Header>
          <a:Action>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/SignalResponse</a:Action>
          <a:MessageID>uuid:9AFBE220-925B-427C-ADF4-024809FFAD80</a:MessageID>
          <a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To>
          <a:RelatesTo>uuid:00000000-0000-0000-0000-000000000003</a:RelatesTo>
        </s:Header>
        <s:Body>
          <rsp:SignalResponse />
        </s:Body>
      </s:Envelope>
- Request:
    Method: POST
    Url: https://127.0.0.1:5986/wsman
    Headers: {}
    Body: >-
      <?xml version="1.0" encoding="utf-16"?>

      <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:cfg="http://schemas.microsoft.com/wbem/wsman/1/config" xmlns:env="http://www.w3.org/2003/05/soap-envelope">
        <env:Header>
          <a:To>http://windows-host:5985/wsman</a:To>
          <a:ReplyTo>
            <a:Address mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
          </a:ReplyTo>
          <w:MaxEnvelopeSize a:mustUnderstand="true">153600</w:MaxEnvelopeSize>
          <a:MessageID>uuid:00000000-0000-0000-0000-000000000004</a:MessageID>
          <w:Locale a:mustUnderstand="false" xml:lang="en-US" />
          <p:DataLocale a:mustUnderstand="false" xml:lang="en-US" />
          <w:OperationTimeout>PT5S</w:OperationTimeout>
          <w:ResourceURI a:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
          <a:Action mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/Delete</a:Action>
          <w:SelectorSet>
            <w:Selector Name="ShellId">C5D0E586-F22B-425C-AB7C-6355765E0CF8</w:Selector>
          </w:SelectorSet>
        </env:Header>
        <env:Body />
      </env:Envelope>
  Response:
    StatusCode: 200
    Headers:
      Server: Microsoft-HTTPAPI/2.0
      Date: Fri, 16 Dec 2022 23:58:25 GMT
    Body: >-
      <s:Envelope xml:lang="en-US" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
        <s:Header>
          <a:Action>http://schemas.xmlsoap.org/ws/2004/09/transfer/DeleteResponse</a:Action>
          <a:MessageID>uuid:CCA6CA16-A85B-4F07-822E-F47F018EE0D1</a:MessageID>
          <a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To>
          <a:RelatesTo>uuid:00000000-0000-0000-0000-000000000004</a:RelatesTo>
        </s:Header>
        <s:Body></s:Body>
      </s:Envelope>
